1．下面哪些是操作符，哪些是值？
*
'hello'
-88.8
-
/

答：
*，-，/ 为操作符
'hello'，-88.8 为值

2．下面哪个是变量，哪个是字符串？
spam	为变量
'spam'	为字符串

3．说出 3 种数据类型。
str，int，float

4．表达式由什么构成？所有表达式都做什么事？

表达式是值和操作符的结合。所有表达式都求值为（即归约为）一个值。

5．本章介绍了赋值语句，如 spam = 10。表达式和语句有什么区别？
表达式求值为一个值。语句不是这样

6．下列语句运行后，变量 bacon 的值是什么？
bacon = 20
bacon + 1

21

7．下面两个表达式求值的结果是什么？
'spam' + 'spamspam'	'spamspamspam'
'spam' * 3		'spamspamspam'


8．为什么 eggs 是有效的变量名，而 100 是无效的？
数字不能作为变量

9．哪 3 个函数能分别取得一个值的整型、浮点型或字符串版本？
int()
float()
str()


10．为什么这个表达式会导致错误？如何修复？
'I have eaten ' + 99 + ' burritos.'

数字和字符串不能做拼接
'I have eaten ' + str(99) + ' burritos.'


